[
  {
    "Session ID": "915928",
    "Title": "How LLMs work for Web Devs: GPT in 600 lines of Vanilla JS",
    "Description": "Don't be intimidated. Modern AI can feel like magic, but underneath the hood are principles that web developers can understand, even if you don't have a machine learning background. In this workshop, we'll explore a complete GPT-2 inference implementation built entirely in Vanilla JS. This JavaScript translation of the popular \"Spreadsheets-are-all-you-need\" approach will let you debug and step through a real LLM line by line without the overhead of learning a new language, framework, or even IDE.\r\n\r\nAll the major LLMs, including ChatGPT, Claude, DeepSeek, and Llama, inherit from GPT-2's architecture, making this exploration a solid foundation to understand modern AI systems and comprehend the latest research.\r\n\r\nWhile we won't have time to cover *everything*, you'll gain the essential knowledge to understand the key concepts that matter when building with LLMs, including how they:\r\n\r\n-Convert raw text into meaningful tokens\r\n- Represent semantic meaning through vector embeddings\r\n- Train neural networks through gradient descent\r\n- Generate text with sampling algorithms like top-k, top-p, and temperature\r\n\r\nThis intense but beginner-friendly workshop is designed specifically for web developers diving into ML and AI for the first time. It’s your \"missing AI degree\" in just two hours. You'll walk away with an intuitive mental model of how Transformers work that you can apply immediately to your own LLM-powered projects.",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Golden Gate Ballroom A: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T11:00:00",
    "Speakers": "Ishan Anand",
    "Companies": "Independent"
  },
  {
    "Session ID": "936933",
    "Title": "Forget RAG Pipelines—Build Production-Ready AI Agents in 15 Minutes",
    "Description": "Want to take advantage of your data, but don't want to reinvent RAG infrastructure? Join our workshop and see how you can deploy Agentic RAG in minutes using Contextual AI's managed RAG solution. We'll explore how Contextual handles intelligent parsing and chunking of your data, retrieves information with state of the art accuracy, and generates responses with a multi layered set of guardrails against hallucinations. Together, we'll build an end-to-end Agentic RAG pipeline and demonstrate its integration with Claude Desktop via MCP, so you can see how this could plug into your existing ecosystem. \r\n\r\nBy the end of this session, you'll have a functioning Agentic RAG prototype that you can easily customize and deploy to production for your specific use cases, even with complex, unstructured documents. ",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T10:20:00",
    "Speakers": "Nina Lopatina, Rajiv Shah",
    "Companies": "Contextual AI, Contextual AI"
  },
  {
    "Session ID": "933714",
    "Title": "Intro to GraphRAG",
    "Description": "Learn the foundations of GraphRAG, starting with knowledge graph construction and then common retrieval patterns.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T10:20:00",
    "Speakers": "Zach Blumenfeld",
    "Companies": "Neo4j "
  },
  {
    "Session ID": "929509",
    "Title": "Kernels, RL, Reasoning, Reward Functions & Quantization",
    "Description": "Discover if writing custom kernels is still worth it, explore how to do Reinforcement Learning (RL) and reward functions properly, and learn why quantization is key to local LLMs - plus tips to gain accuracy.",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Foothill C: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Unsloth AI N/A",
    "Companies": "Unsloth AI"
  },
  {
    "Session ID": "916066",
    "Title": "Introduction to LLM serving with SGLang",
    "Description": "Do you want to learn how to serve models like DeepSeek and Qwen with SOTA speeds on launch day? SGLang is an open-source fast serving framework for LLMs and VLMs that generates trillions of tokens per day at companies like xAI, AMD, and Meituan. This workshop guides AI engineers who are familiar with serving models using frameworks like vLLM, Ollama, and TensorRT-LLM through deploying and optimizing their first model with SGLang, as well as providing guidance on when SGLang is the appropriate tool for LLM workloads.",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "SOMA: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T10:20:00",
    "Speakers": "Philip Kiely, Yineng Zhang",
    "Companies": "Baseten, Baseten"
  },
  {
    "Session ID": "911821",
    "Title": "A2A & MCP: Automating Business Processes with LLMs",
    "Description": "Ever wished your webhooks could think for themselves? Join us to discover how A2A agents can transform passive webhook endpoints into intelligent workflow processors.\r\n\r\nIn this session, we'll show you how to build a system that automatically spawns AI Agents to handle incoming webhooks. \r\n\r\nUsing Google's Agent-to-Agent framework and MCP, you'll learn how to create dynamic AI agents that respond to events, communicate with external services, and make decisions based on content analysis.\r\n\r\nSee the future of workflow automation where webhooks don't just trigger actions—they trigger intelligence!",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T10:20:00",
    "Speakers": "Damien Murphy",
    "Companies": "Bench Computing"
  },
  {
    "Session ID": "915684",
    "Title": "Beyond Benchmarks: Strategies for Evaluating LLMs in Production",
    "Description": "Accuracy scores and leaderboard metrics look impressive—but production-grade AI requires evals that reflect real-world performance, reliability, and user happiness. Traditional benchmarks rarely help you understand how your LLM will perform when embedded in complex workflows or agentic systems. How can you realistically and adequately measure reasoning quality, agent consistency, MCP integration, and user-focused outcomes?\r\n\r\nIn this practical, example-driven talk, we'll go beyond standard benchmarks and dive into tangible evaluation strategies using various open-source frameworks like GuideLLM and lm-eval-harness. You'll see concrete examples of how to create custom eval suites tailored to your use case, integrate human-in-the-loop feedback effectively, and implement agent reliability checks that reflect production conditions. Walk away with actionable insights and best practices for evaluating and improving your LLMs, ensuring they meet real-world expectations—not just leaderboard positions!",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Nobhill A&B: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "startsAt": "2025-06-03T09:00:00",
    "endsAt": "2025-06-03T10:20:00",
    "Speakers": "Taylor Jordan Smith",
    "Companies": "Red Hat"
  },
  {
    "Session ID": "913965",
    "Title": "The AI Engineer’s Guide to Raising VC",
    "Description": "A no fluff, all tactics discussion. More AI engineers should build startups, the world needs more software. But there’s a way to raise VC and it’s hard to do it if you’ve never seen it done. We are going to walk through the exact playbook to raise your first round of funding. We will show you real pitch decks, real cold emails and real term sheets so when you go out to raise your first round of funding, you are setup to do it. Every AI Engineer should be equip to start their own company and this session makes sure raising $$$ is not going to be the blocker.",
    "Session Format": "Talk",
    "Assigned Track": "",
    "Room": "Salons 2-6: Workshops",
    "Scheduled At": "3 Jun 2025 09:50 AM",
    "startsAt": "2025-06-03T09:50:00",
    "endsAt": "2025-06-03T10:20:00",
    "Speakers": "Dani Grant, Chelcie Taylor",
    "Companies": "Jam.dev, Notable Capital"
  },
  {
    "Session ID": "916131",
    "Title": "Milliseconds to Magic: Real‑Time Workflows using the Gemini Live API and Pipecat",
    "Description": "The Gemini Live API GA  is now powered by Google's best cost-effective thinking model Gemini 2.5 Flash. We will do a deep dive on the capabilities that the Gemini Live API combined with Pipecat unlock for devs with special focus on session management, turn detection, tool use (including async function calls), proactivity, multilinguality and integration with telephony and other infra. We will demo some of the more innovative capabilities. We will also talk through some customer use cases - especially how customers can use Pipecat to extend these realtime multimodal capabilities to client side applications such as customer support agents, gaming agents, tutoring agents etc. In addition, we also have an experimental version of the Live API powered by with Google's native audio offering that can be tried in an experimental capacity . This experimental model  can communicate with seamless, emotive, steerable, multilingual dialogue and enhances use cases where more natural voices can be a big differentiator. ",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Salons 2-6: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Shrestha Basu Mallick, Kwindla Kramer",
    "Companies": "Google DeepMind, Daily"
  },
  {
    "Session ID": "936937",
    "Title": "Circle Workshop",
    "Description": "",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Corey Cooper",
    "Companies": "Circle"
  },
  {
    "Session ID": "942803",
    "Title": "Mastering AI Evaluation: From Playground to Production with Braintrust",
    "Description": "This hands-on workshop will guide participants through the complete AI evaluation lifecycle using Braintrust, from initial prompt testing to production monitoring. Attendees will learn to build evaluation frameworks that ensure their AI applications perform reliably in real-world scenarios. Topics covered include both offline and online evaluation strategies, logging and feedback systems, and human review processes.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Doug Guthrie",
    "Companies": "Braintrust"
  },
  {
    "Session ID": "933707",
    "Title": "Building Multimodal AI Agents (From Scratch)",
    "Description": "In this hands-on workshop, you will build a multimodal AI agent capable of processing mixed-media content—from analyzing charts and diagrams to extracting insights from documents with embedded visuals. Using MongoDB as a vector database and memory store, and Google's Gemini for multimodal reasoning, you will gain hands-on experience with multimodal data processing pipelines and agent orchestration patterns by implementing core components directly, using good ol' Python.\r\n",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "SOMA: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Apoorva Joshi",
    "Companies": "MongoDB"
  },
  {
    "Session ID": "907684",
    "Title": "Scoring models beat LLM judges any day of the week",
    "Description": "Do you wish your LLM judge was highly accurate, rapid fast, data-tunable, and continuously integrated across your stack? This talk describes a new architecture for AI metrics based on foundation scoring models and a set of integrations that run above them. This architecture was inspired by decades of AI and machine learning development in Google Search, reinvented for the modern LLM stack by our team over the past year. \r\n\r\nWe will share the history of that trajectory and then dive into the technical details: the use of encoder models trained specifically for scoring to enable higher accuracy and lower latency and the deployment of auto-generated tunable metric trees that can combine a wide variety of soft and hard signals across your stack into a human-calibrated score. We’ll end with various examples of how these scoring models are being deployed across the whole stack from online control flows for agents, to reward models for algorithms like RL, to rankers for inference time scaling methods like ensemble generation.\r\n",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "David Karam",
    "Companies": "Pi Labs"
  },
  {
    "Session ID": "915961",
    "Title": "Ship Agents that Ship: A Hands-On Workshop for SWE Agent Builders",
    "Description": "Coding agents are transforming how software gets built, tested, and deployed, but engineering teams face a critical challenge: how to embrace this automation wave without sacrificing trust, control, or reliability.\r\nIn this 110-minute workshop, you’ll go beyond toy demos and build production-minded AI agents using Dagger, the programmable delivery engine designed for real CI/CD and AI-native workflows. Whether you're debugging failures, triaging pull requests, generating tests, or shipping features, you'll learn how to orchestrate autonomous agents that live in and around your codebase: from your laptop to your CI platform.\r\nWe’ll guide you through:\r\n\r\nBuilding real-world agents with Dagger and popular LLMs (GPT, Claude, etc.)\r\n\r\nProgramming agent environments using real languages (Go, Python, TypeScript)\r\n\r\nExecuting agent workflows locally and in GitHub Actions, so you can bring them to production\r\n\r\nUsing a composable runtime that ensures isolation, determinism, traceability, and repeatability\r\n\r\nDesigning agents that automate and enhance debugging, test generation, code review, bug fixing, and feature implementation\r\n\r\n\r\nBy the end of the workshop, you’ll walk away ready to build your own army of autonomous agents, working collaboratively across your codebase, locally and in CI, accelerating development without ceding control. Let’s build agents that don’t just talk, they ship!",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Nobhill A&B: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Kyle Penfound, Jeremy Adams",
    "Companies": "Dagger, Dagger"
  },
  {
    "Session ID": "935459",
    "Title": "Piloting agents in GitHub Copilot",
    "Description": "The agent capabilities added to GitHub Copilot have enhanced its ability to act as a peer programmer. Copilot can now discover and generate code based on existing standards, run tests, recover from errors, and call tools using Model Context Protocol (MCP). This workshop will guide you through piloting Copilot's agent capabilities and how to best integrate with the most widely adopted AI coding assistant in the world.\r\n\r\nKey takeaways include:\r\n\r\n- Understanding how and when to bring agents into your software development workflow\r\n- Providing context through the use of custom instructions and prompt files to ensure consistency across your team\r\n- Discovering how MCP provides access to an additional set of external tools and capabilities that the agent can use\r\n- Configuring Copilot's agentic capabilities to take advantage of your custom MCP server\r\n- Recommended best practices to help your responsibly accelerate your development while maintaining code quality and governance",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Nobhill C&D: Microsoft",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "startsAt": "2025-06-03T10:40:00",
    "endsAt": "2025-06-03T12:00:00",
    "Speakers": "Christopher Harrison",
    "Companies": "GitHub"
  },
  {
    "Session ID": "929790",
    "Title": "Useful General Intelligence",
    "Description": "We’re all hearing that AI agents will enable AGI, but they can’t yet reliably perform even basic computer tasks. It turns out that getting AI to click, type, and scroll is more challenging than getting it to generate code. How can we build general-purpose agents that can do anything we can do on a computer? \r\n\r\nThis is our goal at the Amazon AGI SF Lab. In this talk, I’ll propose a new approach to agents that we call Useful General Intelligence. After describing how we’re solving the biggest challenges in computer use while enabling developers to access our tech in it’s earliest developmental stages, I’ll show real workflows that developers have built with Nova Act, our agentic model and SDK. ",
    "Session Format": "Keynote",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: Workshops",
    "Scheduled At": "3 Jun 2025 12:40 PM",
    "startsAt": "2025-06-03T12:40:00",
    "endsAt": "2025-06-03T13:00:00",
    "Speakers": "Danielle Perszyk",
    "Companies": "Amazon"
  },
  {
    "Session ID": "935456",
    "Title": "Real-World Development with GitHub Copilot and VS Code",
    "Description": "Join us for a hands-on workshop designed to demonstrate how VS Code and GitHub Copilot's expanding suite of AI features can match or even surpasses the benefits of other popular AI developer tools.  We'll focus on practical scenarios to ensure immediate applicability and work through live demos of Copilot features such as: Code generation using Edits, Planning/problem solving using Chat, Inline terminal command generation, Boilerplate code generation using Agent mode, Improving boilerplate with custom instructions and then refactoring using Agent mode and Edits, Improving test generation and code reviews with custom instructions, as well as an Introduction to MCP. \r\nPre Requisit - install GitHub Copilot and VS Code",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Salons 2-6: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Harald Kirschner, Christopher Harrison",
    "Companies": "Microsoft, Microsoft"
  },
  {
    "Session ID": "933607",
    "Title": "Building Agents with Amazon Nova Act and MCP",
    "Description": "In this 2-hour workshop, participants will gain practical hands-on experience building sophisticated AI agents using Amazon's agent technologies. You'll learn to build agents that can navigate the web like humans, perform complex multi-step tasks, and leverage specialized tools through natural language commands. You’ll explore Amazon Nova Act for reliable web navigation, Model Context Protocol (MCP) for connecting agents to external data sources and APIs, and Amazon Bedrock Agents for orchestrating complex workflows. Through guided exercises, you'll create agents capable of retrieving information and taking action across web applications, all through natural language interactions. By the end of this workshop, you'll have the practical skills to build AI agents that can browse websites, interact with web interfaces, and solve multi-step problems by combining these powerful Amazon technologies.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Duan Lightfoot",
    "Companies": "AWS"
  },
  {
    "Session ID": "930540",
    "Title": "Every Way to Optimize Your Models with OpenAI",
    "Description": "Covering all forms of fine-tuning and prompt engineering, like SFT, DPO, RFT, prompt engineering / optimization, and agent scaffolding.",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Ilan Bigio",
    "Companies": "OpenAI"
  },
  {
    "Session ID": "921229",
    "Title": "Graph Intelligence: Enhance Reasoning and Retrieval Using Graph Analytics",
    "Description": "Advanced GraphRAG techniques apply graph ML and algorithms, wrapped into tidy notebooks.",
    "Session Format": "Workshop",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom C: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Alison Cossette, Andreas Kollegger",
    "Companies": "Neo4j , Neo4j"
  },
  {
    "Session ID": "907544",
    "Title": "Case Study + Deep Dive: Telemedicine Support Agents with LangGraph/MCP",
    "Description": "We've all seen website chat bots which can look up an order or answer a basic question -- but what does it take to build autonomous agents which manage long, delicate processes like multi-day medical treatments?  \r\n\r\nIn this workshop, we'll explore a workflow Stride built in partnership with Avila (https://avilascience.com/) that helps patients self-administer medication regimens at home.  The stack includes LangGraph/LangSmith, Claude, MCP, Node.js, React, MongoDB, and Twilio, and rests on a foundation of treatment \"blueprints\" which LLM-powered agents use to guide patients to good outcomes.  \r\n\r\nYou'll learn how to:\r\n-Build a hybrid system of code and prompts that leverages LLM decisioning to drive a web application, message queue and database\r\n-Design and maintain flexible agentic workflow blueprints, with no special tools (just Google Docs!)\r\n-Create an agent evaluation system, which uses LLM-as-a-judge to evaluate the complexity of each interaction and escalate to human support when needed\r\n\r\nWe'll also talk about the prompt engineered guidelines and guardrails which helps agents adhere to protocol as much as possible, while gracefully handling curveballs from the patient.  Please bring questions -- we look forward to sharing our learnings on how to make agentic systems like this work in the real world!",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Foothill C: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Dan Mason",
    "Companies": "Stride"
  },
  {
    "Session ID": "910732",
    "Title": "AI Engineering with the Google Gemini 2.5 Model Family",
    "Description": "Hands on Workshop on learning to use Gemini 2.5 Pro in combination with Agentic tooling and MCP Servers.",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "SOMA: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Philipp Schmid",
    "Companies": "Google DeepMind"
  },
  {
    "Session ID": "916214",
    "Title": "Information Retrieval from the Ground Up",
    "Description": "Vector search is only a feature. Search engines and information retrieval have retaken their position as the foundation of RAG. This workshop takes you through decades of research, what has been working for a long time, and how it got better with Machine Learning.",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Philipp Krenn",
    "Companies": "Elastic"
  },
  {
    "Session ID": "939088",
    "Title": "From Mixture of Experts to Mixture of Agents … with Super Fast Inference",
    "Description": "Our hands-on workshop will walk you through how to build your own Mixture of Agents (MoA) system using the fastest, and most capable open models available: Qwen3-32B and Llama 3.3-70B. MoA is an emerging architecture that combines the strengths of multiple large language models in a layered, agent-based design. This approach delivers superior performance by enabling specialized agents to collaborate across layers—outperforming today’s frontier models in both accuracy and efficiency.\r\n\r\nTo ground this new paradigm in its roots, we’ll also explore how Mixture of Experts (MoE) architectures continue to push the boundaries of scale and specialization. Learn how Cerebras trains state-of-the-art MoEs from Daria Soboleva, Head Research Scientist.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "startsAt": "2025-06-03T13:00:00",
    "endsAt": "2025-06-03T15:00:00",
    "Speakers": "Daniel Kim, Daria Soboleva",
    "Companies": "Cerebras, Cerebras"
  },
  {
    "Session ID": "933688",
    "Title": "AI Pipelines and Agents in Pure TypeScript with Mastra.ai",
    "Description": "This hands-on workshop introduces Mastra.ai, a TypeScript framework that streamlines the development of agentic AI systems compared to traditional approaches using LangChain and vector databases. Participants will learn to build structured AI workflows with composable tools and reliable control, enabling them to create internal AI assistants that can handle requests like data cleaning, email drafting, and document summarization with minimal code. The session covers Mastra installation, running a local MCP server, defining tools and agents in TypeScript, using the Mastra playground, and implementing practical examples such as RAG setups and tool-chaining agents—all designed to equip attendees with the skills to develop scalable AI-driven internal tools based on sound software engineering principles rather than just experimental prompts.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Salons 2-6: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Nick Nisi",
    "Companies": "WorkOS "
  },
  {
    "Session ID": "933632",
    "Title": "Agentic Coding with Windsurf",
    "Description": "Agentic coding marks a new era in software development, where AI agents take on autonomous roles in coding tasks. The Windsurf IDE embodies this shift by integrating intelligent agents like Cascade, which maintain full codebase context to perform multi-file edits, run terminal commands, and suggest changes through tools like Supercomplete and Flows. In this session, we will explore features that allow developers to guide strategy while the AI handles execution, enhancing productivity and enabling more creative, high-level work.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Numair Baseer",
    "Companies": "Windsurf"
  },
  {
    "Session ID": "914537",
    "Title": "Building voice agents with OpenAI",
    "Description": "We'll walk through the differences between chained and speech-to-speech powered voice agents, how to approach them, best practices and transform a text-based agent into our first voice-enabled agent",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Dominik Kundel",
    "Companies": "OpenAI"
  },
  {
    "Session ID": "942858",
    "Title": "How to build world-class AI products (featuring Sarah Sachs, AI lead @ Notion)",
    "Description": "Join us for a hands-on workshop where you'll learn practical strategies to evaluate AI applications throughout their lifecycle—from initial testing of prompts to ongoing monitoring in production. We’re excited to host Sarah Sachs, AI Lead at Notion, who will share insights into how Notion built their acclaimed Notion AI.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Carlos  Esteban",
    "Companies": "Braintrust"
  },
  {
    "Session ID": "933560",
    "Title": "Navigating deep context in legacy code with Augment Agent",
    "Description": "Attendees will learn to use an AI coding agent as a fast and intuitive part of navigating and working with complex, production-grade legacy code bases. We will drop directly into the code–written in assembly–that landed the1969 Apollo 11 astronauts on the moon and, through a series of challenges, locate parts of the code tied to key functionality. Using the agent to convert a key guidance computer algorithm into a more modern programming language, attendees will then compete to see whose code has what it takes to land on the moon.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Foothill C: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Forrest Brazeal, Matt Ball",
    "Companies": "Augment Code, Augment Code "
  },
  {
    "Session ID": "933593",
    "Title": "Building Voice Agents with Gemini and Pipecat",
    "Description": "Hands-on workshop led by engineers from Google and Daily",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "SOMA: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Chad Bailey, Kwindla Kramer",
    "Companies": "Daily, Daily"
  },
  {
    "Session ID": "933721",
    "Title": "VoiceVision RAG - Integrating Visual Document Intelligence with Voice Response",
    "Description": "In this workshop we will explore the integration of Colpali, a cutting-edge Vision based Retrieval Model, with voice synthesis for next-generation RAG systems. We'll demonstrate how Colpali's ability to generate multi-vector embeddings directly from document images bypasses traditional OCR and complex preprocessing, while adding voice output creates a more intuitive and accessible user experience. Attendees will see how this combination handles documents with mixed textual and visual information, leading to more efficient and accurate information retrieval with natural voice responses.",
    "Session Format": "Workshop",
    "Assigned Track": "",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Suman Debnath",
    "Companies": "Amazon Web Services"
  },
  {
    "Session ID": "915269",
    "Title": "Shipping AI That Works: An Evaluation Framework for PMs",
    "Description": "GenAI is reshaping the product landscape, creating huge opportunities (along with new expectations) for product managers. Yet while prompt engineering and model tuning get the spotlight, one critical skill can get overlooked: rigorous evaluation.\r\n\r\nThis talk will help PMs move beyond gut-feel “vibe checks” to adopt concrete, repeatable evaluation strategies for LLM-powered products. I'll break down essential eval methodologies, from human feedback and code-based checks to cutting-edge LLM-based evaluations. Drawing on real-world examples, I'll share a practical framework PMs can use to:\r\n\r\n-Confidently evaluate AI-driven features\r\n- Ground decisions in real, repeatable data\r\n- Build trust and delight through consistent quality\r\n",
    "Session Format": "Workshop",
    "Assigned Track": "Workshop",
    "Room": "Nobhill A&B: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "startsAt": "2025-06-03T15:30:00",
    "endsAt": "2025-06-03T17:30:00",
    "Speakers": "Aman Khan",
    "Companies": "Arize"
  },
  {
    "Session ID": "936800",
    "Title": "Spark to System: Building the Open Agentic Web",
    "Description": "AI builders no longer ask whether to use agents—but how many and how fast. In this kickoff keynote, Microsoft’s Asha Sharma shows what happens when natural language creation meets an industrial grade backbone.  Watch live demos—to see agents move from idea to production in real time. Walk out with the commands, repos, and open protocols to build your piece of the agentic web.",
    "Session Format": "Keynote",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 09:20 AM",
    "startsAt": "2025-06-04T09:20:00",
    "endsAt": "2025-06-04T09:40:00",
    "Speakers": "Asha  Sharma",
    "Companies": "Microsoft"
  },
  {
    "Session ID": "927324",
    "Title": "Conviction Session",
    "Description": "Please Fill in",
    "Session Format": "Keynote",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 09:40 AM",
    "startsAt": "2025-06-04T09:40:00",
    "endsAt": "2025-06-04T10:00:00",
    "Speakers": "Sarah Guo",
    "Companies": "Greylock Partners"
  },
  {
    "Session ID": "935987",
    "Title": "Simon Willison Keynote",
    "Description": "",
    "Session Format": "Keynote",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 10:00 AM",
    "startsAt": "2025-06-04T10:00:00",
    "endsAt": "2025-06-04T10:20:00",
    "Speakers": "Simon Willison",
    "Companies": "Lishtot"
  },
  {
    "Session ID": "933472",
    "Title": "AI-powered entomology: Lessons from millions of AI code reviews",
    "Description": "This talk will explore insights from millions of automated code reviews, revealing trends in bugs, vulnerabilities, and code health that Graphite’s AI code review agent have uncovered. This talk will also provide meta commentary into the types of bugs AI code review agents are great at spotting, and how far the field of AI code review has come in the last year alone.",
    "Session Format": "",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 10:45 AM",
    "startsAt": "2025-06-04T10:45:00",
    "endsAt": "2025-06-04T11:00:00",
    "Speakers": "Tomas Reimers",
    "Companies": "Graphite"
  },
  {
    "Session ID": "933692",
    "Title": "Architecting Agent Memory: Principles, Patterns, and Best Practices",
    "Description": "In the rapidly evolving landscape of agentic systems, memory management has emerged as a key pillar for building intelligent, context-aware AI Agents. Inspired by the complexity of human memory systems—such as episodic, working, semantic, and procedural memory—this talk unpacks how AI agents can achieve believability, reliability, and capability by retaining and reasoning over past experiences.\r\nWe’ll begin by establishing a conceptual framework based on real-world implementations from memory management libraries and system architectures:\r\nMemory Components representing various structured memory types (e.g., conversation, workflow, episodic, persona)\r\nMemory Modes reflecting operational strategies for short-term, long-term, and dynamic memory handling\r\nNext, the talk transitions to practical implementation patterns critical for effective memory lifecycle management:\r\nMaintaining rich conversation history and contextual awareness\r\nPersistence strategies leveraging vector databases and hybrid search\r\nMemory augmentation using embeddings, relevance scoring, and semantic retrieval\r\nProduction-ready practices for scaling memory in multi-agent ecosystems\r\nWe’ll also examine advanced memory strategies within agentic systems:\r\nMemory cascading and selective deletion\r\nIntegration of tool use and persona memory\r\nOptimizing performance around memory retrieval and LLM context window limits\r\nWhether you're developing autonomous agents, chatbots, or complex workflow orchestration systems, this talk offers knowledge and tactical insights for building AI that can remember, adapt, and improve over time.\r\nThis session is ideal for:\r\nAI engineers and agent framework developers\r\nArchitects designing Agentic RAG or multi-agent systems\r\nPractitioners building contextual, personalized AI experiences\r\nBy the end of the session, you’ll understand how to leverage memory as a strategic asset in agentic design—and walk away ready to build agents that not only act and reason but also remember.\t",
    "Session Format": "",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 10:45 AM",
    "startsAt": "2025-06-04T10:45:00",
    "endsAt": "2025-06-04T11:00:00",
    "Speakers": "Richmond Alake",
    "Companies": "MongoDB"
  },
  {
    "Session ID": "933493",
    "Title": "Realtime conversational video with Pipecat and Tavus",
    "Description": "Tavus shipped the world's first realtime video avatar platform last year. Developers use Tavus' conversational video APIs to create education, social, and customer support agents. The Tavus team built their innovative product using the Pipecat open source framework and Daily's global WebRTC infrastructure. Join us for a technical deep dive into conversational video.",
    "Session Format": "",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 10:45 AM",
    "startsAt": "2025-06-04T10:45:00",
    "endsAt": "2025-06-04T11:00:00",
    "Speakers": "Chad Bailey, Brian Johnson, Kwindla Kramer",
    "Companies": "Daily, Tavus, Daily"
  },
  {
    "Session ID": "933684",
    "Title": "Mastering Engineering Flow with Windsurf",
    "Description": "As experienced engineers, especially senior and staff engineers, our focus shifts towards complex problem-solving, architectural decisions, and mentoring. While AI tools promise productivity gains, Windsurf offers more than just code completion and chat assistance – it's an agentic IDE built to enhance engineering flow. This talk explores how experienced engineers can leverage Windsurf's deep contextual awareness, structured guidance, and automated workflows to tackle sophisticated and complex tasks. We'll demonstrate practical strategies for accelerating feature development, automating code maintenance and reviews, and ultimately freeing up cognitive load to focus on high-impact engineering challenges. Learn how to move beyond basic AI assistance and truly partner with Windsurf to excel in your role.",
    "Session Format": "Talk",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 11:00 AM",
    "startsAt": "2025-06-04T11:00:00",
    "endsAt": "2025-06-04T11:15:00",
    "Speakers": "Eashan Sinha",
    "Companies": "Windsurf"
  },
  {
    "Session ID": "933709",
    "Title": "What does Enterprise Ready MCP mean?",
    "Description": "Everyone is building MCP servers: from Slack integrations to personal data tools. They're good demos, but not ready to turn into production. So, what does it take to make MCP *enterprise-ready?*\r\n\r\nWe're going to cover the end-to-end process of getting a hacky MCP server authenticated, permissioned, and secure. We'll talk about registries, SSO, audit logs, agent identifiers, autonomy for agents, and oversight. Oh and we'll use MCP to buy some stuff.\r\n\r\nCome learn the stack needed to scale your MCP to the enterprise and some fun hacks along the way.",
    "Session Format": "",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 11:00 AM",
    "startsAt": "2025-06-04T11:00:00",
    "endsAt": "2025-06-04T11:15:00",
    "Speakers": "Tobin  South",
    "Companies": "WorkOS"
  },
  {
    "Session ID": "936298",
    "Title": "To the moon! Navigating deep context in legacy code with Augment Agent",
    "Description": "Shortened presentation-only version of our Apollo 11 workshop",
    "Session Format": "Talk",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 11:00 AM",
    "startsAt": "2025-06-04T11:00:00",
    "endsAt": "2025-06-04T11:15:00",
    "Speakers": "Forrest Brazeal, Matt Ball",
    "Companies": "Augment Code, Augment Code "
  },
  {
    "Session ID": "927452",
    "Title": "[Placeholder] MCP Origins",
    "Description": "Early prototypes and demos from inside anthropic that have guided our thinking around MCP",
    "Session Format": "Talk",
    "Assigned Track": "MCP (02)",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "startsAt": "2025-06-04T11:15:00",
    "endsAt": "2025-06-04T11:35:00",
    "Speakers": "Jerome Swannack",
    "Companies": "Anthropic"
  },
  {
    "Session ID": "929337",
    "Title": "Recsys Keynote: Improving Recommendation Systems & Search in the Age of LLMs",
    "Description": "Recommendation systems and search have long adopted advances in language modeling, from early adoption of Word2vec for embedding-based retrieval to the transformative impact of GRUs, Transformers, and BERT on predicting user interactions. Now, the rise of large language models (LLMs) is inspiring innovations in model architecture, scalable system designs, and richer customer experiences.\r\n\r\nIn this keynote, we'll dive into cutting-edge industry applications of LLMs in recommendation and search systems, exploring real-world implementations and measurable outcomes. Join us for an look at current trends and an exciting vision of how LLM-driven techniques will shape the future of content discovery and intelligent search.",
    "Session Format": "Talk",
    "Assigned Track": "LLM RecSys (03)",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "startsAt": "2025-06-04T11:15:00",
    "endsAt": "2025-06-04T11:35:00",
    "Speakers": "Eugene Yan",
    "Companies": "Amazon"
  },
  {
    "Session ID": "915992",
    "Title": "HybridRAG: A Fusion of Graph and Vector Retrieval to Enhance Data Interpretation",
    "Description": "Interpreting complex information from unstructured text data poses significant challenges to Large Language Models (LLM), with difficulties often arising from specialized terminology and the multifaceted relationships between entities in document architectures. Conventional Retrieval Augmented Generation (RAG) methods face limitations in capturing these nuanced interactions, leading to suboptimal performance. In our talk, we introduce a novel approach integrating Knowledge Graph-based RAG (GraphRAG) with VectorRAG, designed to refine question-answering (Q&A) systems for more effective information extraction from complex texts. Our approach employs a dual retrieval strategy that harnesses both knowledge graphs and vector databases, enabling the generation of precise and contextually appropriate answers, thereby setting a new standard for LLMs in processing sophisticated data.",
    "Session Format": "Talk",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "startsAt": "2025-06-04T11:15:00",
    "endsAt": "2025-06-04T11:35:00",
    "Speakers": "Mitesh Patel",
    "Companies": "NVIDIA"
  },
  {
    "Session ID": "903524",
    "Title": "From Copilot to Colleague: Building Trustworthy Productivity Agents for High-Stakes Work",
    "Description": "This keynote will explore what it takes to move from basic generative assistants to fully agentic AI—systems that don’t just suggest but plan, act, and adapt—all within the structured, high-trust environments where professionals actually work.",
    "Session Format": "Talk",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "startsAt": "2025-06-04T11:15:00",
    "endsAt": "2025-06-04T11:35:00",
    "Speakers": "Joel Hron",
    "Companies": "Thomson Reuters"
  }
]